{"id": "Sec. 6.001", "title": "INSUPPORTABILITY", "text": "On the petition of either party to a marriage, the court may grant a divorce without regard to fault if the marriage has become insupportable because of discord or conflict of personalities that destroys the legitimate ends of the marital relationship and prevents any reasonable expectation of reconciliation.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.002", "title": "CRUELTY", "text": "The court may grant a divorce in favor of one spouse if the other spouse is guilty of cruel treatment toward the complaining spouse of a nature that renders further living together insupportable.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.003", "title": "ADULTERY", "text": "The court may grant a divorce in favor of one spouse if the other spouse has committed adultery.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.004", "title": "CONVICTION OF FELONY", "text": "(a)  The court may grant a divorce in favor of one spouse if during the marriage the other spouse:\n\n(1)  has been convicted of a felony;\n\n(2)  has been imprisoned for at least one year in the Texas Department of Criminal Justice, a federal penitentiary, or the penitentiary of another state; and\n\n(3)  has not been pardoned.\n\n(b)  The court may not grant a divorce under this section against a spouse who was convicted on the testimony of the other spouse.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.\n\nAmended by: \n\nActs 2009, 81st Leg., R.S., Ch. 87 (S.B. 1969), Sec. 25.056, eff. September 1, 2009."}
{"id": "Sec. 6.005", "title": "ABANDONMENT", "text": "The court may grant a divorce in favor of one spouse if the other spouse:\n\n(1)  left the complaining spouse with the intention of abandonment;  and\n\n(2)  remained away for at least one year.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.006", "title": "LIVING APART", "text": "The court may grant a divorce in favor of either spouse if the spouses have lived apart without cohabitation for at least three years.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.007", "title": "CONFINEMENT IN MENTAL HOSPITAL", "text": "The court may grant a divorce in favor of one spouse if at the time the suit is filed:\n\n(1)  the other spouse has been confined in a state mental hospital or private mental hospital, as defined in Section 571.003, Health and Safety Code, in this state or another state for at least three years;  and\n\n(2)  it appears that the hospitalized spouse's mental disorder is of such a degree and nature that adjustment is unlikely or that, if adjustment occurs, a relapse is probable.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.008", "title": "DEFENSES", "text": "(a)  The defenses to a suit for divorce of recrimination and adultery are abolished.\n\n(b)  Condonation is a defense to a suit for divorce only if the court finds that there is a reasonable expectation of reconciliation.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.\n\n\n\n\nSUBCHAPTER B. GROUNDS FOR ANNULMENT"}
{"id": "Sec. 6.102", "title": "ANNULMENT OF MARRIAGE OF PERSON UNDER AGE 18", "text": "(a)  The court may grant an annulment of a marriage of a person 16 years of age or older but under 18 years of age that occurred without parental consent or without a court order as provided by Subchapters B and E, Chapter 2.\n\n(b)  A petition for annulment under this section may be filed by:\n\n(1)  a next friend for the benefit of the underage party;\n\n(2)  a parent;  or\n\n(3)  the judicially designated managing conservator or guardian of the person of the underage party, whether an individual, authorized agency, or court.\n\n(c)  A suit filed under this subsection by a next friend is barred unless it is filed within 90 days after the date of the marriage.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.\n\nAmended by: \n\nActs 2005, 79th Leg., Ch. 268 (S.B. 6), Sec. 4.16, eff. September 1, 2005.\n\nActs 2007, 80th Leg., R.S., Ch. 52 (S.B. 432), Sec. 3, eff. September 1, 2007."}
{"id": "Sec. 6.103", "title": "UNDERAGE ANNULMENT BARRED BY ADULTHOOD", "text": "A suit to annul a marriage may not be filed under Section 6.102 by a parent, managing conservator, or guardian of a person after the 18th birthday of the person.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.\n\nAmended by: \n\nActs 2007, 80th Leg., R.S., Ch. 52 (S.B. 432), Sec. 4, eff. September 1, 2007."}
{"id": "Sec. 6.104", "title": "DISCRETIONARY ANNULMENT OF UNDERAGE MARRIAGE", "text": "(a)  An annulment under Section 6.102 of a marriage may be granted at the discretion of the court sitting without a jury.\n\n(b)  In exercising its discretion, the court shall consider the pertinent facts concerning the welfare of the parties to the marriage, including whether the female is pregnant.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.\n\nAmended by: \n\nActs 2007, 80th Leg., R.S., Ch. 52 (S.B. 432), Sec. 5, eff. September 1, 2007."}
{"id": "Sec. 6.105", "title": "UNDER INFLUENCE OF ALCOHOL OR NARCOTICS", "text": "The court may grant an annulment of a marriage to a party to the marriage if:\n\n(1)  at the time of the marriage the petitioner was under the influence of alcoholic beverages or narcotics and as a result did not have the capacity to consent to the marriage;  and\n\n(2)  the petitioner has not voluntarily cohabited with the other party to the marriage since the effects of the alcoholic beverages or narcotics ended.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.106", "title": "IMPOTENCY", "text": "The court may grant an annulment of a marriage to a party to the marriage if:\n\n(1)  either party, for physical or mental reasons, was permanently impotent at the time of the marriage;\n\n(2)  the petitioner did not know of the impotency at the time of the marriage;  and\n\n(3)  the petitioner has not voluntarily cohabited with the other party since learning of the impotency.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.107", "title": "FRAUD, DURESS, OR FORCE", "text": "The court may grant an annulment of a marriage to a party to the marriage if:\n\n(1)  the other party used fraud, duress, or force to induce the petitioner to enter into the marriage;  and\n\n(2)  the petitioner has not voluntarily cohabited with the other party since learning of the fraud or since being released from the duress or force.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.108", "title": "MENTAL INCAPACITY", "text": "(a)  The court may grant an annulment of a marriage to a party to the marriage on the suit of the party or the party's guardian or next friend, if the court finds it to be in the party's best interest to be represented by a guardian or next friend, if:\n\n(1)  at the time of the marriage the petitioner did not have the mental capacity to consent to marriage or to understand the nature of the marriage ceremony because of a mental disease or defect;  and\n\n(2)  since the marriage ceremony, the petitioner has not voluntarily cohabited with the other party during a period when the petitioner possessed the mental capacity to recognize the marriage relationship.\n\n(b)  The court may grant an annulment of a marriage to a party to the marriage if:\n\n(1)  at the time of the marriage the other party did not have the mental capacity to consent to marriage or to understand the nature of the marriage ceremony because of a mental disease or defect;\n\n(2)  at the time of the marriage the petitioner neither knew nor reasonably should have known of the mental disease or defect;  and\n\n(3)  since the date the petitioner discovered or reasonably should have discovered the mental disease or defect, the petitioner has not voluntarily cohabited with the other party.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.109", "title": "CONCEALED DIVORCE", "text": "(a)  The court may grant an annulment of a marriage to a party to the marriage if:\n\n(1)  the other party was divorced from a third party within the 30-day period preceding the date of the marriage ceremony;\n\n(2)  at the time of the marriage ceremony the petitioner did not know, and a reasonably prudent person would not have known, of the divorce;  and\n\n(3)  since the petitioner discovered or a reasonably prudent person would have discovered the fact of the divorce, the petitioner has not voluntarily cohabited with the other party.\n\n(b)  A suit may not be brought under this section after the first anniversary of the date of the marriage.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.110", "title": "MARRIAGE LESS THAN 72 HOURS AFTER ISSUANCE OF LICENSE", "text": "(a)  The court may grant an annulment of a marriage to a party to the marriage if the marriage ceremony took place in violation of Section 2.204 during the 72-hour period immediately following the issuance of the marriage license.\n\n(b)  A suit may not be brought under this section after the 30th day after the date of the marriage.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.111", "title": "DEATH OF PARTY TO VOIDABLE MARRIAGE", "text": "Except as provided by Subchapter C, Chapter 123, Estates Code, a marriage subject to annulment may not be challenged in a proceeding instituted after the death of either party to the marriage.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.\n\nAmended by: \n\nActs 2007, 80th Leg., R.S., Ch. 1170 (H.B. 391), Sec. 4.03, eff. September 1, 2007.\n\nActs 2017, 85th Leg., R.S., Ch. 324 (S.B. 1488), Sec. 22.016, eff. September 1, 2017.\n\n\n\n\nSUBCHAPTER C. DECLARING A MARRIAGE VOID"}
{"id": "Sec. 6.201", "title": "CONSANGUINITY", "text": "A marriage is void if one party to the marriage is related to the other as:\n\n(1)  an ancestor or descendant, by blood or adoption;\n\n(2)  a brother or sister, of the whole or half blood or by adoption;\n\n(3)  a parent's brother or sister, of the whole or half blood or by adoption;  or\n\n(4)  a son or daughter of a brother or sister, of the whole or half blood or by adoption.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.202", "title": "MARRIAGE DURING EXISTENCE OF PRIOR MARRIAGE", "text": "(a)  A marriage is void if entered into when either party has an existing marriage to another person that has not been dissolved by legal action or terminated by the death of the other spouse.\n\n(b)  The later marriage that is void under this section becomes valid when the prior marriage is dissolved if, after the date of the dissolution, the parties have lived together as husband and wife and represented themselves to others as being married.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.203", "title": "CERTAIN VOID MARRIAGES VALIDATED", "text": "Except for a marriage that would have been void under Section 6.201, a marriage that was entered into before January 1, 1970, in violation of the prohibitions of Article 496, Penal Code of Texas, 1925, is validated from the date the marriage commenced if the parties continued until January 1, 1970, to live together as husband and wife and to represent themselves to others as being married.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.204", "title": "RECOGNITION OF SAME-SEX MARRIAGE OR CIVIL UNION", "text": "(a)  In this section, \"civil union\" means any relationship status other than marriage that:\n\n(1)  is intended as an alternative to marriage or applies primarily to cohabitating persons;  and\n\n(2)  grants to the parties of the relationship legal protections, benefits, or responsibilities granted to the spouses of a marriage.\n\n(b)  A marriage between persons of the same sex or a civil union is contrary to the public policy of this state and is void in this state.\n\n(c)  The state or an agency or political subdivision of the state may not give effect to a:\n\n(1)  public act, record, or judicial proceeding that creates, recognizes, or validates a marriage between persons of the same sex or a civil union in this state or in any other jurisdiction;  or\n\n(2)  right or claim to any legal protection, benefit, or responsibility asserted as a result of a marriage between persons of the same sex or a civil union in this state or in any other jurisdiction.\n\n\nAdded by Acts 2003, 78th Leg., ch. 124, Sec. 1, eff. Sept. 1, 2003."}
{"id": "Sec. 6.205", "title": "MARRIAGE TO MINOR", "text": "A marriage is void if either party to the marriage is younger than 18 years of age, unless a court order removing the disabilities of minority of the party for general purposes has been obtained in this state or in another state.\n\n\nAdded by Acts 2005, 79th Leg., Ch. 268 (S.B. 6), Sec. 4.17, eff. September 1, 2005.\n\nAmended by: \n\nActs 2007, 80th Leg., R.S., Ch. 52 (S.B. 432), Sec. 6, eff. September 1, 2007.\n\nActs 2017, 85th Leg., R.S., Ch. 934 (S.B. 1705), Sec. 5, eff. September 1, 2017."}
{"id": "Sec. 6.206", "title": "MARRIAGE TO STEPCHILD OR STEPPARENT", "text": "A marriage is void if a party is a current or former stepchild or stepparent of the other party.\n\n\nAdded by Acts 2005, 79th Leg., Ch. 268 (S.B. 6), Sec. 4.17, eff. September 1, 2005.\n\n\n\n\nSUBCHAPTER D. JURISDICTION, VENUE, AND RESIDENCE QUALIFICATIONS"}
{"id": "Sec. 6.301", "title": "GENERAL RESIDENCY RULE FOR DIVORCE SUIT", "text": "A suit for divorce may not be maintained in this state unless at the time the suit is filed either the petitioner or the respondent has been:\n\n(1)  a domiciliary of this state for the preceding six-month period;  and\n\n(2)  a resident of the county in which the suit is filed for the preceding 90-day period.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.302", "title": "SUIT FOR DIVORCE BY NONRESIDENT SPOUSE", "text": "If one spouse has been a domiciliary of this state for at least the last six months, a spouse domiciled in another state or nation may file a suit for divorce in the county in which the domiciliary spouse resides at the time the petition is filed.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.303", "title": "ABSENCE ON PUBLIC SERVICE", "text": "Time spent by a Texas domiciliary outside this state or outside the county of residence of the domiciliary while in the service of the armed forces or other service of the United States or of this state, or while accompanying the domiciliary's spouse in the spouse's service of the armed forces or other service of the United States or of this state, is considered residence in this state and in that county.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.\n\nAmended by: \n\nActs 2011, 82nd Leg., R.S., Ch. 436 (S.B. 1159), Sec. 1, eff. June 17, 2011."}
{"id": "Sec. 6.304", "title": "ARMED FORCES PERSONNEL NOT PREVIOUSLY RESIDENTS", "text": "A person not previously a resident of this state who is serving in the armed forces of the United States and has been stationed at one or more military installations in this state for at least the last six months and at a military installation in a county of this state for at least the last 90 days, or who is accompanying the person's spouse during the spouse's military service in those locations and for those periods, is considered to be a Texas domiciliary and a resident of that county for those periods for the purpose of filing suit for dissolution of a marriage.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.\n\nAmended by: \n\nActs 2011, 82nd Leg., R.S., Ch. 436 (S.B. 1159), Sec. 1, eff. June 17, 2011."}
{"id": "Sec. 6.305", "title": "ACQUIRING JURISDICTION OVER NONRESIDENT RESPONDENT", "text": "(a)  If the petitioner in a suit for dissolution of a marriage is a resident or a domiciliary of this state at the time the suit for dissolution is filed, the court may exercise personal jurisdiction over the respondent or over the respondent's personal representative although the respondent is not a resident of this state if:\n\n(1)  this state is the last marital residence of the petitioner and the respondent and the suit is filed before the second anniversary of the date on which marital residence ended;  or\n\n(2)  there is any basis consistent with the constitutions of this state and the United States for the exercise of the personal jurisdiction.\n\n(b)  A court acquiring jurisdiction under this section also acquires jurisdiction over the respondent in a suit affecting the parent-child relationship.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.306", "title": "JURISDICTION TO ANNUL MARRIAGE", "text": "(a)  A suit for annulment of a marriage may be maintained in this state only if the parties were married in this state or if either party is domiciled in this state.\n\n(b)  A suit for annulment is a suit in rem, affecting the status of the parties to the marriage.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.307", "title": "JURISDICTION TO DECLARE MARRIAGE VOID", "text": "(a)  Either party to a marriage made void by this chapter may sue to have the marriage declared void, or the court may declare the marriage void in a collateral proceeding.\n\n(b)  The court may declare a marriage void only if:\n\n(1)  the purported marriage was contracted in this state;  or\n\n(2)  either party is domiciled in this state.\n\n(c)  A suit to have a marriage declared void is a suit in rem, affecting the status of the parties to the purported marriage.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.308", "title": "EXERCISING PARTIAL JURISDICTION", "text": "(a)  A court in which a suit for dissolution of a marriage is filed may exercise its jurisdiction over those portions of the suit for which it has authority.\n\n(b)  The court's authority to resolve the issues in controversy between the parties may be restricted because the court lacks:\n\n(1)  the required personal jurisdiction over a nonresident party in a suit for dissolution of the marriage;\n\n(2)  the required jurisdiction under Chapter 152;  or\n\n(3)  the required jurisdiction under Chapter 159.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.\n\n\n\n\nSUBCHAPTER E. FILING SUIT"}
{"id": "Sec. 6.401", "title": "CAPTION", "text": "(a)  Pleadings in a suit for divorce or annulment shall be styled \"In the Matter of the Marriage of __________ and __________.\"\n\n(b)  Pleadings in a suit to declare a marriage void shall be styled \"A Suit To Declare Void the Marriage of __________ and __________.\"\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.402", "title": "PLEADINGS", "text": "(a)  A petition in a suit for dissolution of a marriage is sufficient without the necessity of specifying the underlying evidentiary facts if the petition alleges the grounds relied on substantially in the language of the statute.\n\n(b)  Allegations of grounds for relief, matters of defense, or facts relied on for a temporary order that are stated in short and plain terms are not subject to special exceptions because of form or sufficiency.\n\n(c)  The court shall strike an allegation of evidentiary fact from the pleadings on the motion of a party or on the court's own motion.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.403", "title": "ANSWER", "text": "The respondent in a suit for dissolution of a marriage is not required to answer on oath or affirmation.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.4035", "title": "WAIVER OF SERVICE", "text": "(a)  A party to a suit for the dissolution of a marriage may waive the issuance or service of process after the suit is filed by filing with the clerk of the court in which the suit is filed the waiver of the party acknowledging receipt of a copy of the filed petition.\n\n(b)  The waiver must contain the mailing address of the party who executed the waiver.\n\n(c)  Notwithstanding Section 132.001, Civil Practice and Remedies Code, the waiver must be sworn before a notary public who is not an attorney in the suit.  This subsection does not apply if the party executing the waiver is incarcerated.\n\n(d)  The Texas Rules of Civil Procedure do not apply to a waiver executed under this section.\n\n(e)  The party executing the waiver may not sign the waiver using a digitized signature.\n\n(f)  For purposes of this section, \"digitized signature\" has the meaning assigned by Section 101.0096.\n\n\nAdded by Acts 1997, 75th Leg., ch. 614, Sec. 1, eff. Sept. 1, 1997.\n\nAmended by: \n\nActs 2013, 83rd Leg., R.S., Ch. 916 (H.B. 1366), Sec. 2, eff. September 1, 2013.\n\nActs 2015, 84th Leg., R.S., Ch. 198 (S.B. 814), Sec. 1, eff. September 1, 2015."}
{"id": "Sec. 6.404", "title": "INFORMATION REGARDING PROTECTIVE ORDERS", "text": "At any time while a suit for dissolution of a marriage is pending, if the court believes, on the basis of any information received by the court, that a party to the suit or a member of the party's family or household may be a victim of family violence, the court shall inform that party of the party's right to apply for a protective order under Title 4.\n\n\nAdded by Acts 2005, 79th Leg., Ch. 361 (S.B. 1275), Sec. 2, eff. June 17, 2005."}
{"id": "Sec. 6.405", "title": "PROTECTIVE ORDER AND RELATED ORDERS", "text": "(a)  The petition in a suit for dissolution of a marriage must state whether, in regard to a party to the suit or a child of a party to the suit:\n\n(1)  there is in effect:\n\n(A)  a protective order under Title 4;\n\n(B)  a protective order under Subchapter A, Chapter 7B, Code of Criminal Procedure; or\n\n(C)  an order for emergency protection under Article 17.292, Code of Criminal Procedure; or\n\n(2)  an application for an order described by Subdivision (1) is pending.\n\n(b)  The petitioner shall attach to the petition a copy of each order described by Subsection (a)(1) in which a party to the suit or the child of a party to the suit was the applicant or victim of the conduct alleged in the application or order and the other party was the respondent or defendant of an action regarding the conduct alleged in the application or order without regard to the date of the order.  If a copy of the order is not available at the time of filing, the petition must state that a copy of the order will be filed with the court before any hearing.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.  Amended by Acts 1999, 76th Leg., ch. 62, Sec. 6.04, eff. Sept. 1, 1999.\n\nAmended by: \n\nActs 2017, 85th Leg., R.S., Ch. 885 (H.B. 3052), Sec. 1, eff. September 1, 2017.\n\nActs 2019, 86th Leg., R.S., Ch. 469 (H.B. 4173), Sec. 2.30, eff. January 1, 2021."}
{"id": "Sec. 6.406", "title": "MANDATORY JOINDER OF SUIT AFFECTING PARENT-CHILD RELATIONSHIP", "text": "(a)  The petition in a suit for dissolution of a marriage shall state whether there are children born or adopted of the marriage who are under 18 years of age or who are otherwise entitled to support as provided by Chapter 154.\n\n(a-1)  If the parties to a suit for dissolution of a marriage are the intended parents under a gestational agreement that is in effect and that establishes a parent-child relationship between the parties as intended parents and an unborn child on the birth of the child, the petition in the suit for dissolution of a marriage shall state:\n\n(1)  that the parties to the marriage have entered into a gestational agreement establishing a parent-child relationship between the parties as intended parents and an unborn child on the birth of the child;\n\n(2)  whether the gestational mother under the agreement is pregnant or a child who is the subject of the agreement has been born; and\n\n(3)  whether the agreement has been validated under Section 160.756.\n\n(b)  If the parties are parents of a child, as defined by Section 101.003, and the child is not under the continuing jurisdiction of another court as provided by Chapter 155, the suit for dissolution of a marriage must include a suit affecting the parent-child relationship under Title 5.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.\n\nAmended by: \n\nActs 2019, 86th Leg., R.S., Ch. 130 (H.B. 1689), Sec. 1, eff. September 1, 2019."}
{"id": "Sec. 6.407", "title": "TRANSFER OF SUIT AFFECTING PARENT-CHILD RELATIONSHIP TO DIVORCE COURT", "text": "(a)  If a suit affecting the parent-child relationship is pending at the time the suit for dissolution of a marriage is filed, the suit affecting the parent-child relationship shall be transferred as provided by Section 103.002 to the court in which the suit for dissolution is filed.\n\n(b)  If the parties are parents of a child, as defined by Section 101.003, and the child is under the continuing jurisdiction of another court under Chapter 155, either party to the suit for dissolution of a marriage may move that court for transfer of the suit affecting the parent-child relationship to the court having jurisdiction of the suit for dissolution.  The court with continuing jurisdiction shall transfer the proceeding as provided by Chapter 155.  On the transfer of the proceedings, the court with jurisdiction of the suit for dissolution of a marriage shall consolidate the two causes of action.\n\n(c)  After transfer of a suit affecting the parent-child relationship as provided in Chapter 155, the court with jurisdiction of the suit for dissolution of a marriage has jurisdiction to render an order in the suit affecting the parent-child relationship as provided by Title 5.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.408", "title": "SERVICE OF CITATION", "text": "Citation on the filing of an original petition in a suit for dissolution of a marriage shall be issued and served as in other civil cases.  Citation may also be served on any other person who has or who may assert an interest in the suit for dissolution of the marriage.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.409", "title": "CITATION BY PUBLICATION", "text": "(a)  Citation in a suit for dissolution of a marriage may be by publication as in other civil cases, except that notice shall be published one time only.\n\n(b)  The notice shall be sufficient if given in substantially the following form:\n\n\"STATE OF TEXAS\n\n\nTo (name of person to be served with citation), and to all whom it may concern (if the name of any person to be served with citation is unknown), Respondent(s),\n\n\"You have been sued.  You may employ an attorney.  If you or your attorney do not file a written answer with the clerk who issued this citation by 10 a.m. on the Monday next following the expiration of 20 days after you were served this citation and petition, a default judgment may be taken against you.  The petition of __________, Petitioner, was filed in the Court of __________ County, Texas, on the ______ day of __________, against __________, Respondent(s), numbered ______, and entitled  'In the Matter of Marriage of __________ and __________. The suit requests __________ (statement of relief sought).'\n\n\"The Court has authority in this suit to enter any judgment or decree dissolving the marriage and providing for the division of property that will be binding on you.\n\n\"Issued and given under my hand and seal of said Court at __________, Texas, this the ______ day of __________, ______.\n\n\"..............................\n\nClerk of the __________ Court of\n\n____________ County, Texas     \n\nBy _______, Deputy.\"\n\n(c)  The form authorized in this section and the form authorized by Section 102.010 may be combined in appropriate situations.\n\n(d)  If the citation is for a suit in which a parent-child relationship does not exist, service by publication may be completed by posting the citation at the courthouse door for seven days in the county in which the suit is filed.\n\n(e)  If the petitioner or the petitioner's attorney of record makes an oath that no child presently under 18 years of age was born or adopted by the spouses and that no appreciable amount of property was accumulated by the spouses during the marriage, the court may dispense with the appointment of an attorney ad litem.  In a case in which citation was by publication, a statement of the evidence, approved and signed by the judge, shall be filed with the papers of the suit as a part of the record.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.410", "title": "REPORT TO ACCOMPANY PETITION", "text": "At the time a petition for divorce or annulment of a marriage is filed, the petitioner shall also file a completed report that may be used by the district clerk, at the time the petition is granted, to comply with Section 194.002, Health and Safety Code.\n\n\nAdded by Acts 2003, 78th Leg., ch. 1128, Sec. 4, eff. Sept. 1, 2003."}
{"id": "Sec. 6.411", "title": "CONFIDENTIALITY OF PLEADINGS", "text": "(a)  This section applies only in a county with a population of 3.4 million or more.\n\n(b)  Except as otherwise provided by law, all pleadings and other documents filed with the court in a suit for dissolution of a marriage are confidential, are excepted from required public disclosure under Chapter 552, Government Code, and may not be released to a person who is not a party to the suit until after the date of service of citation or the 31st day after the date of filing the suit, whichever date is sooner.\n\n\nAdded by Acts 2003, 78th Leg., ch. 1314, Sec. 1, eff. Sept. 1, 2003.\n\nRenumbered from Family Code, Section 6.410 by Acts 2005, 79th Leg., Ch. 728 (H.B. 2018), Sec. 23.001(24), eff. September 1, 2005.\n\n\n\n\nSUBCHAPTER F. TEMPORARY ORDERS"}
{"id": "Sec. 6.501", "title": "TEMPORARY RESTRAINING ORDER", "text": "(a)  After the filing of a suit for dissolution of a marriage, on the motion of a party or on the court's own motion, the court may grant a temporary restraining order without notice to the adverse party for the preservation of the property and for the protection of the parties as necessary, including an order prohibiting one or both parties from:\n\n(1)  intentionally communicating in person or in any other manner, including by telephone or another electronic voice transmission, video chat, in writing, or electronic messaging, with the other party by use of vulgar, profane, obscene, or indecent language or in a coarse or offensive manner, with intent to annoy or alarm the other party;\n\n(2)  threatening the other party in person or in any other manner, including by telephone or another electronic voice transmission, video chat, in writing, or electronic messaging, to take unlawful action against any person, intending by this action to annoy or alarm the other party;\n\n(3)  placing a telephone call, anonymously, at an unreasonable hour, in an offensive and repetitious manner, or without a legitimate purpose of communication with the intent to annoy or alarm the other party;\n\n(4)  intentionally, knowingly, or recklessly causing bodily injury to the other party or to a child of either party;\n\n(5)  threatening the other party or a child of either party with imminent bodily injury;\n\n(6)  intentionally, knowingly, or recklessly destroying, removing, concealing, encumbering, transferring, or otherwise harming or reducing the value of the property of the parties or either party with intent to obstruct the authority of the court to order a division of the estate of the parties in a manner that the court deems just and right, having due regard for the rights of each party and any children of the marriage;\n\n(7)  intentionally falsifying a writing or record, including an electronic record, relating to the property of either party;\n\n(8)  intentionally misrepresenting or refusing to disclose to the other party or to the court, on proper request, the existence, amount, or location of any tangible or intellectual property of the parties or either party, including electronically stored or recorded information;\n\n(9)  intentionally or knowingly damaging or destroying the tangible or intellectual property of the parties or either party, including electronically stored or recorded information;\n\n(10)  intentionally or knowingly tampering with the tangible or intellectual property of the parties or either party, including electronically stored or recorded information, and causing pecuniary loss or substantial inconvenience to the other party;\n\n(11)  except as specifically authorized by the court:\n\n(A)  selling, transferring, assigning, mortgaging, encumbering, or in any other manner alienating any of the property of the parties or either party, regardless of whether the property is:\n\n(i)  personal property, real property, or intellectual property; or\n\n(ii)  separate or community property;\n\n(B)  incurring any debt, other than legal expenses in connection with the suit for dissolution of marriage;\n\n(C)  withdrawing money from any checking or savings account in a financial institution for any purpose;\n\n(D)  spending any money in either party's possession or subject to either party's control for any purpose;\n\n(E)  withdrawing or borrowing money in any manner for any purpose from a retirement, profit sharing, pension, death, or other employee benefit plan, employee savings plan, individual retirement account, or Keogh account of either party; or\n\n(F)  withdrawing or borrowing in any manner all or any part of the cash surrender value of a life insurance policy on the life of either party or a child of the parties;\n\n(12)  entering any safe deposit box in the name of or subject to the control of the parties or either party, whether individually or jointly with others;\n\n(13)  changing or in any manner altering the beneficiary designation on any life insurance policy on the life of either party or a child of the parties;\n\n(14)  canceling, altering, failing to renew or pay premiums on, or in any manner affecting the level of coverage that existed at the time the suit was filed of, any life, casualty, automobile, or health insurance policy insuring the parties' property or persons, including a child of the parties;\n\n(15)  opening or diverting mail or e-mail or any other electronic communication addressed to the other party;\n\n(16)  signing or endorsing the other party's name on any negotiable instrument, check, or draft, including a tax refund, insurance payment, and dividend, or attempting to negotiate any negotiable instrument payable to the other party without the personal signature of the other party;\n\n(17)  taking any action to terminate or limit credit or charge credit cards in the name of the other party;\n\n(18)  discontinuing or reducing the withholding for federal income taxes from either party's wages or salary;\n\n(19)  destroying, disposing of, or altering any financial records of the parties, including a canceled check, deposit slip, and other records from a financial institution, a record of credit purchases or cash advances, a tax return, and a financial statement;\n\n(20)  destroying, disposing of, or altering any e-mail, text message, video message, or chat message or other electronic data or electronically stored information relevant to the subject matter of the suit for dissolution of marriage, regardless of whether the information is stored on a hard drive, in a removable storage device, in cloud storage, or in another electronic storage medium;\n\n(21)  modifying, changing, or altering the native format or metadata of any electronic data or electronically stored information relevant to the subject matter of the suit for dissolution of marriage, regardless of whether the information is stored on a hard drive, in a removable storage device, in cloud storage, or in another electronic storage medium;\n\n(22)  deleting any data or content from any social network profile used or created by either party or a child of the parties;\n\n(23)  using any password or personal identification number to gain access to the other party's e-mail account, bank account, social media account, or any other electronic account;\n\n(24)  terminating or in any manner affecting the service of water, electricity, gas, telephone, cable television, or any other contractual service, including security, pest control, landscaping, or yard maintenance at the residence of either party, or in any manner attempting to withdraw any deposit paid in connection with any of those services;\n\n(25)  excluding the other party from the use and enjoyment of a specifically identified residence of the other party;\n\n(26)  entering, operating, or exercising control over a motor vehicle in the possession of the other party; or\n\n(27)  tracking or monitoring personal property or a motor vehicle in the possession of a party, without that party's effective consent, including by:\n\n(A)  using a tracking application on a personal electronic device in the possession of that party or using a tracking device; or\n\n(B)  physically following that party or causing another to physically follow that party.\n\n(b)  A temporary restraining order under this subchapter may not include a provision:\n\n(1)  the subject of which is a requirement, appointment, award, or other order listed in Section 64.104, Civil Practice and Remedies Code;  or\n\n(2)  that:\n\n(A)  excludes a spouse from occupancy of the residence where that spouse is living except as provided in a protective order made in accordance with Title 4;  \n\n(B)  prohibits a party from spending funds for reasonable and necessary living expenses;  or\n\n(C)  prohibits a party from engaging in acts reasonable and necessary to conduct that party's usual business and occupation.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.  Amended by Acts 1999, 76th Leg., ch. 1081, Sec. 6, eff. Sept. 1, 1999.\n\nAmended by: \n\nActs 2015, 84th Leg., R.S., Ch. 43 (S.B. 815), Sec. 1, eff. September 1, 2015.\n\nActs 2023, 88th Leg., R.S., Ch. 839 (H.B. 2715), Sec. 4, eff. September 1, 2023."}
{"id": "Sec. 6.502", "title": "TEMPORARY INJUNCTION AND OTHER TEMPORARY ORDERS", "text": "(a)  While a suit for dissolution of a marriage is pending and on the motion of a party or on the court's own motion after notice and hearing, the court may render an appropriate order, including the granting of a temporary injunction for the preservation of the property and protection of the parties as deemed necessary and equitable and including an order directed to one or both parties:\n\n(1)  requiring a sworn inventory and appraisement of the real and personal property owned or claimed by the parties and specifying the form, manner, and substance of the inventory and appraisal and list of debts and liabilities;\n\n(2)  requiring payments to be made for the support of either spouse;\n\n(3)  requiring the production of books, papers, documents, and tangible things by a party;\n\n(4)  ordering payment of reasonable attorney's fees and expenses;\n\n(5)  appointing a receiver for the preservation and protection of the property of the parties;\n\n(6)  awarding one spouse exclusive occupancy of the residence during the pendency of the case;\n\n(7)  prohibiting the parties, or either party, from spending funds beyond an amount the court determines to be for reasonable and necessary living expenses;\n\n(8)  awarding one spouse exclusive control of a party's usual business or occupation;  or\n\n(9)  prohibiting an act described by Section 6.501(a).\n\n(a-1)  If the court on its own motion refers to mediation a suit described by Subsection (a) in which a motion for a temporary order described by that subsection is pending, the court may not postpone the initial hearing on the pending motion to a date that is later than the 30th day after the date set for the hearing.\n\n(b)  Not later than the 30th day after the date a receiver is appointed under Subsection (a)(5), the receiver shall give notice of the appointment to each lienholder of any property under the receiver's control.\n\n(c)  Not later than the seventh day after the date a receiver is appointed under Subsection (a)(5), the court shall issue written findings of fact and conclusions of law in support of the receiver's appointment.  If the court dispenses with the issuance of a bond between the spouses as provided by Section 6.503(b) in connection with the receiver's appointment, the court shall include in the court's findings an explanation of the reasons the court dispensed with the issuance of a bond.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.  Amended by Acts 2001, 77th Leg., ch. 695, Sec. 1, eff. Sept. 1, 2001.\n\nAmended by: \n\nActs 2017, 85th Leg., R.S., Ch. 493 (H.B. 2703), Sec. 1, eff. September 1, 2017.\n\nActs 2023, 88th Leg., R.S., Ch. 509 (H.B. 2671), Sec. 1, eff. September 1, 2023."}
{"id": "Sec. 6.503", "title": "AFFIDAVIT, VERIFIED PLEADING, AND BOND NOT REQUIRED", "text": "(a)  A temporary restraining order or temporary injunction under this subchapter:\n\n(1)  may be granted without an affidavit or a verified pleading stating specific facts showing that immediate and irreparable injury, loss, or damage will result before notice can be served and a hearing can be held;  and\n\n(2)  need not:\n\n(A)  define the injury or state why it is irreparable;\n\n(B)  state why the order was granted without notice;  or\n\n(C)  include an order setting the suit for trial on the merits with respect to the ultimate relief sought.\n\n(b)  In a suit for dissolution of a marriage, the court may dispense with the issuance of a bond between the spouses in connection with temporary orders for the protection of the parties and their property.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.504", "title": "PROTECTIVE ORDERS", "text": "On the motion of a party to a suit for dissolution of a marriage, the court may render a protective order as provided by Subtitle B, Title 4.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.  Amended by Acts 1997, 75th Leg., ch. 1193, Sec. 1, eff. Sept. 1, 1997."}
{"id": "Sec. 6.505", "title": "COUNSELING", "text": "(a)  While a divorce suit is pending, the court may direct the parties to counsel with a person named by the court.\n\n(b)  The person named by the court to counsel the parties shall submit a written report to the court and to the parties before the final hearing.  In the report, the counselor shall give only an opinion as to whether there exists a reasonable expectation of reconciliation of the parties and, if so, whether further counseling would be beneficial.  The sole purpose of the report is to aid the court in determining whether the suit for divorce should be continued pending further counseling.\n\n(c)  A copy of the report shall be furnished to each party.\n\n(d)  If the court believes that there is a reasonable expectation of the parties' reconciliation, the court may by written order continue the proceedings and direct the parties to a person named by the court for further counseling for a period fixed by the court not to exceed 60 days, subject to any terms, conditions, and limitations the court considers desirable.  In ordering counseling, the court shall consider the circumstances of the parties, including the needs of the parties' family and the availability of counseling services.  At the expiration of the period specified by the court, the counselor to whom the parties were directed shall report to the court whether the parties have complied with the court's order.  Thereafter, the court shall proceed as in a divorce suit generally.\n\n(e)  If the court orders counseling under this section and the parties to the marriage are the parents of a child under 18 years of age born or adopted during the marriage, the counseling shall include counseling on issues that confront children who are the subject of a suit affecting the parent-child relationship.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.  Amended by Acts 1997, 75th Leg., ch. 1325, Sec. 1, eff. Sept. 1, 1997."}
{"id": "Sec. 6.506", "title": "CONTEMPT", "text": "The violation of a temporary restraining order, temporary injunction, or other temporary order issued under this subchapter is punishable as contempt.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.507", "title": "INTERLOCUTORY APPEAL", "text": "An order under this subchapter, except an order appointing a receiver, is not subject to interlocutory appeal.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.\n\n\n\n\nSUBCHAPTER G. ALTERNATIVE DISPUTE RESOLUTION"}
{"id": "Sec. 6.601", "title": "ARBITRATION PROCEDURES", "text": "(a)  On written agreement of the parties, the court may refer a suit for dissolution of a marriage to arbitration.  The agreement must state whether the arbitration is binding or nonbinding.\n\n(b)  If the parties agree to binding arbitration, the court shall render an order reflecting the arbitrator's award.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.6015", "title": "DETERMINATION OF VALIDITY AND ENFORCEABILITY OF CONTRACT CONTAINING AGREEMENT TO ARBITRATE", "text": "(a)  If a party to a suit for dissolution of a marriage opposes an application to compel arbitration or makes an application to stay arbitration and asserts that the contract containing the agreement to arbitrate is not valid or enforceable, notwithstanding any provision of the contract to the contrary, the court shall try the issue promptly and may order arbitration only if the court determines that the contract containing the agreement to arbitrate is valid and enforceable against the party seeking to avoid arbitration.\n\n(b)  A determination under this section that a contract is valid and enforceable does not affect the court's authority to stay arbitration or refuse to compel arbitration on any other ground provided by law.\n\n(c)  This section does not apply to:\n\n(1)  a court order;\n\n(2)  a mediated settlement agreement described by Section 6.602;\n\n(3)  a collaborative law agreement described by Section 6.603;\n\n(4)  a written settlement agreement reached at an informal settlement conference described by Section 6.604; or\n\n(5)  any other agreement between the parties that is approved by a court.\n\n\nAdded by Acts 2011, 82nd Leg., R.S., Ch. 1088 (S.B. 1216), Sec. 1, eff. June 17, 2011."}
{"id": "Sec. 6.602", "title": "MEDIATION PROCEDURES", "text": "(a)  On the written agreement of the parties or on the court's own motion, the court may refer a suit for dissolution of a marriage to mediation.\n\n(b)  A mediated settlement agreement is binding on the parties if the agreement:\n\n(1)  provides, in a prominently displayed statement that is in boldfaced type or capital letters or underlined, that the agreement is not subject to revocation;\n\n(2)  is signed by each party to the agreement;  and\n\n(3)  is signed by the party's attorney, if any, who is present at the time the agreement is signed.\n\n(c)  If a mediated settlement agreement meets the requirements of this section, a party is entitled to judgment on the mediated settlement agreement notwithstanding Rule 11, Texas Rules of Civil Procedure, or another rule of law.\n\n(d)  A party may at any time prior to the final mediation order file a written objection to the referral of a suit for dissolution of a marriage to mediation on the basis of family violence having been committed against the objecting party by the other party.  After an objection is filed, the suit may not be referred to mediation unless, on the request of the other party, a hearing is held and the court finds that a preponderance of the evidence does not support the objection.  If the suit is referred to mediation, the court shall order appropriate measures be taken to ensure the physical and emotional safety of the party who filed the objection.  The order shall provide that the parties not be required to have face-to-face contact and that the parties be placed in separate rooms during mediation.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.  Amended by Acts 1999, 76th Leg., ch. 178, Sec. 2, eff. Aug. 30, 1999;  Acts 1999, 76th Leg., ch. 1351, Sec. 1, eff. Sept. 1, 1999."}
{"id": "Sec. 6.604", "title": "INFORMAL SETTLEMENT CONFERENCE", "text": "(a)  The parties to a suit for dissolution of a marriage may agree to one or more informal settlement conferences and may agree that the settlement conferences may be conducted with or without the presence of the parties' attorneys, if any.\n\n(b)  A written settlement agreement reached at an informal settlement conference is binding on the parties if the agreement:\n\n(1)  provides, in a prominently displayed statement that is in boldfaced type or in capital letters or underlined, that the agreement is not subject to revocation;\n\n(2)  is signed by each party to the agreement;  and\n\n(3)  is signed by the party's attorney, if any, who is present at the time the agreement is signed.\n\n(c)  If a written settlement agreement meets the requirements of Subsection (b), a party is entitled to judgment on the settlement agreement notwithstanding Rule 11, Texas Rules of Civil Procedure, or another rule of law.\n\n(d)  If the court finds that the terms of the written informal settlement agreement are just and right, those terms are binding on the court.  If the court approves the agreement, the court may set forth the agreement in full or incorporate the agreement by reference in the final decree.\n\n(e)  If the court finds that the terms of the written informal settlement agreement are not just and right, the court may request the parties to submit a revised agreement or set the case for a contested hearing.\n\n\nAdded by Acts 2005, 79th Leg., Ch. 477 (H.B. 202), Sec. 3, eff. September 1, 2005.\n\n\n\n\nSUBCHAPTER H. TRIAL AND APPEAL"}
{"id": "Sec. 6.701", "title": "FAILURE TO ANSWER", "text": "In a suit for divorce, the petition may not be taken as confessed if the respondent does not file an answer.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.702", "title": "WAITING PERIOD", "text": "(a)  Except as provided by Subsection (c), the court may not grant a divorce before the 60th day after the date the suit was filed.  A decree rendered in violation of this subsection is not subject to collateral attack.\n\n(b)  A waiting period is not required before a court may grant an annulment or declare a marriage void other than as required in civil cases generally.\n\n(c)  A waiting period is not required under Subsection (a) before a court may grant a divorce in a suit in which the court finds that:\n\n(1)  the respondent has been finally convicted of or received deferred adjudication for an offense involving family violence as defined by Section 71.004 against the petitioner or a member of the petitioner's household; or\n\n(2)  the petitioner has an active protective order under Title 4 or an active magistrate's order for emergency protection under Article 17.292, Code of Criminal Procedure, based on a finding of family violence, against the respondent because of family violence committed during the marriage.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.\n\nAmended by: \n\nActs 2009, 81st Leg., R.S., Ch. 896 (H.B. 72), Sec. 1, eff. June 19, 2009."}
{"id": "Sec. 6.703", "title": "JURY", "text": "In a suit for dissolution of a marriage, either party may demand a jury trial unless the action is a suit to annul an underage marriage under Section 6.102.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.\n\nAmended by: \n\nActs 2007, 80th Leg., R.S., Ch. 52 (S.B. 432), Sec. 7, eff. September 1, 2007."}
{"id": "Sec. 6.704", "title": "TESTIMONY OF HUSBAND OR WIFE", "text": "(a)  In a suit for dissolution of a marriage, the husband and wife are competent witnesses for and against each other.  A spouse may not be compelled to testify as to a matter that will incriminate the spouse.\n\n(b)  If the husband or wife testifies, the court or jury trying the case shall determine the credibility of the witness and the weight to be given the witness's testimony.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.705", "title": "TESTIMONY BY MARRIAGE COUNSELOR", "text": "(a)  The report by the person named by the court to counsel the parties to a suit for divorce may not be admitted as evidence in the suit.\n\n(b)  The person named by the court to counsel the parties is not competent to testify in any suit involving the parties or their children.\n\n(c)  The files, records, and other work products of the counselor are privileged and confidential for all purposes and may not be admitted as evidence in any suit involving the parties or their children.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.706", "title": "CHANGE OF NAME", "text": "(a)  In a decree of divorce or annulment, the court shall change the name of a party specifically requesting the change to a name previously used by the party unless the court states in the decree a reason for denying the change of name.\n\n(b)  The court may not deny a change of name solely to keep the last name of family members the same.\n\n(c)  A change of name does not release a person from liability incurred by the person under a previous name or defeat a right the person held under a previous name.\n\n(d)  A person whose name is changed under this section may apply for a change of name certificate from the clerk of the court as provided by Section 45.106.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.707", "title": "TRANSFERS AND DEBTS PENDING DECREE", "text": "(a)  A transfer of real or personal community property or a debt incurred by a spouse while a suit for divorce or annulment is pending that subjects the other spouse or the community property to liability is void with respect to the other spouse if the transfer was made or the debt incurred with the intent to injure the rights of the other spouse.\n\n(b)  A transfer or debt is not void if the person dealing with the transferor or debtor spouse did not have notice of the intent to injure the rights of the other spouse.\n\n(c)  The spouse seeking to void a transfer or debt incurred while a suit for divorce or annulment is pending has the burden of proving that the person dealing with the transferor or debtor spouse had notice of the intent to injure the rights of the spouse seeking to void the transaction.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.708", "title": "COSTS; ATTORNEY'S FEES AND EXPENSES", "text": "(a)  In a suit for dissolution of a marriage, the court as it considers reasonable may award costs to a party.  Costs may not be adjudged against a party against whom a divorce is granted for confinement in a mental hospital under Section 6.007.\n\n(b)  The expenses of counseling may be taxed as costs against either or both parties.\n\n(c)  In a suit for dissolution of a marriage, the court may award reasonable attorney's fees and expenses.  The court may order the fees and expenses and any postjudgment interest to be paid directly to the attorney, who may enforce the order in the attorney's own name by any means available for the enforcement of a judgment for debt.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.\n\nAmended by: \n\nActs 2013, 83rd Leg., R.S., Ch. 916 (H.B. 1366), Sec. 3, eff. September 1, 2013.\n\nActs 2013, 83rd Leg., R.S., Ch. 916 (H.B. 1366), Sec. 4, eff. September 1, 2013."}
{"id": "Sec. 6.709", "title": "TEMPORARY ORDERS DURING APPEAL", "text": "(a)  In a suit for dissolution of a marriage, on the motion of a party or on the court's own motion, after notice and hearing, the trial court may render a temporary order as considered equitable and necessary for the preservation of the property and for the protection of the parties during an appeal, including an order directed toward one or both parties:\n\n(1)  requiring the support of either spouse;\n\n(2)  requiring the payment of reasonable and necessary attorney's fees and expenses;\n\n(3)  appointing a receiver for the preservation and protection of the property of the parties;\n\n(4)  awarding one spouse exclusive occupancy of the parties' residence pending the appeal;\n\n(5)  enjoining a party from dissipating or transferring the property awarded to the other party in the trial court's property division; or\n\n(6)  suspending the operation of all or part of the property division that is being appealed.\n\n(b)  A temporary order under this section enjoining a party from dissipating or transferring the property awarded to the other party in the trial court's property division:\n\n(1)  may be rendered without:\n\n(A)  the issuance of a bond between the spouses; or\n\n(B)  an affidavit or a verified pleading stating specific facts showing that immediate and irreparable injury, loss, or damage will result;\n\n(2)  is not required to:\n\n(A)  define the injury or state why the injury is irreparable; or\n\n(B)  include an order setting the suit for trial on the merits with respect to the ultimate relief sought; and\n\n(3)  may not prohibit a party's use, transfer, conveyance, or dissipation of the property awarded to the other party in the trial court's property division if the use, transfer, conveyance, or dissipation of the property is for the purpose of suspending the enforcement of the property division that is the subject of the appeal.\n\n(c)  A temporary order under this section that suspends the operation of all or part of the property division that is the subject of the appeal may not be rendered unless the trial court takes reasonable steps to ensure that the party awarded property in the trial court's property division is protected from the other party's dissipation or transfer of that property.\n\n(d)  In considering a party's request to suspend the enforcement of the property division, the trial court shall consider whether:\n\n(1)  any relief granted under Subsection (a) is adequate to protect the party's interest in the property awarded to the party; or\n\n(2)  the party who was not awarded the property should also be required to provide security for the appeal in addition to any relief granted under Subsection (a).\n\n(e)  If the trial court determines that the party awarded the property can be adequately protected from the other party's dissipation of assets during the appeal only if the other party provides security for the appeal, the trial court shall set the appropriate amount of security, taking into consideration any relief granted under Subsection (a) and the amount of security that the other party would otherwise have to provide by law if relief under Subsection (a) was not granted.\n\n(f)  In rendering a temporary order under this section that suspends enforcement of all or part of the property division, the trial court may grant any relief under Subsection (a), in addition to requiring the party who was not awarded the property to post security for that part of the property division to be suspended.  The trial court may require that the party who was not awarded the property post all or only part of the security that would otherwise be required by law.\n\n(g)  This section does not prevent a party who was not awarded the property from exercising that party's right to suspend the enforcement of the property division as provided by law.\n\n(h)  A motion seeking an original temporary order under this section:\n\n(1)  may be filed before trial; and\n\n(2)  may not be filed by a party after the date by which that party is required to file the party's notice of appeal under the Texas Rules of Appellate Procedure.\n\n(i)  The trial court retains jurisdiction to conduct a hearing and sign an original temporary order under this section until the 60th day after the date any eligible party has filed a notice of appeal from final judgment under the Texas Rules of Appellate Procedure.\n\n(j)  The trial court retains jurisdiction to modify and enforce a temporary order under this section unless the appellate court, on a proper showing, supersedes the trial court's order.\n\n(k)  On the motion of a party or on the court's own motion, after notice and hearing, the trial court may modify a previous temporary order rendered under this section if:\n\n(1)  the circumstances of a party have materially and substantially changed since the rendition of the previous order; and\n\n(2)  modification is equitable and necessary for the preservation of the property or for the protection of the parties during the appeal.\n\n(l)  A party may seek review of the trial court's temporary order under this section by:\n\n(1)  motion filed in the court of appeals with jurisdiction or potential jurisdiction over the appeal from the judgment in the case;\n\n(2)  proper assignment in the party's brief; or\n\n(3)  petition for writ of mandamus.\n\n(m)  A temporary order rendered under this section is not subject to interlocutory appeal.\n\n(n)  The remedies provided in this section are cumulative of all other remedies allowed by law.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997.\n\nAmended by: \n\nActs 2017, 85th Leg., R.S., Ch. 421 (S.B. 1237), Sec. 1, eff. September 1, 2017."}
{"id": "Sec. 6.710", "title": "NOTICE OF FINAL DECREE", "text": "The clerk of the court shall mail a notice of the signing of the final decree of dissolution of a marriage to the party who waived service of process under Section 6.4035 at the mailing address contained in the waiver or the office of the party's attorney of record.  The notice must state that a copy of the decree is available at the office of the clerk of the court and include the physical address of that office.\n\n\nAdded by Acts 1997, 75th Leg., ch. 614, Sec. 2, eff. Sept. 1, 1997.\n\nAmended by: \n\nActs 2011, 82nd Leg., R.S., Ch. 529 (H.B. 2422), Sec. 1, eff. June 17, 2011."}
{"id": "Sec. 6.711", "title": "FINDINGS OF FACT AND CONCLUSIONS OF LAW", "text": "(a)  In a suit for dissolution of a marriage in which the court has rendered a judgment dividing the estate of the parties, on request by a party, the court shall state in writing its findings of fact and conclusions of law, including  the characterization and value of all assets, liabilities, claims, and offsets on which disputed evidence has been presented.\n\n(b)  A request for findings of fact and conclusions of law under this section must conform to the Texas Rules of Civil Procedure.\n\n(c)  The findings of fact and conclusions of law required by this section are in addition to any other findings or conclusions required or authorized by law.\n\n\nAdded by Acts 2001, 77th Leg., ch. 297, Sec. 1, eff. Sept. 1, 2001.\n\nAmended by: \n\nActs 2017, 85th Leg., R.S., Ch. 421 (S.B. 1237), Sec. 2, eff. September 1, 2017."}
{"id": "Sec. 6.712", "title": "DATE OF MARRIAGE REQUIREMENT IN FINAL DECREE", "text": "(a)  In a suit for dissolution of a marriage in which the court grants a divorce, the court shall state the date of the marriage in the decree of divorce.\n\n(b)  This section does not apply to a suit for dissolution of a marriage described by Section 2.401(a)(2).\n\n\nAdded by Acts 2021, 87th Leg., R.S., Ch. 934 (H.B. 3774), Sec. 4.01, eff. September 1, 2021.\n\n\n\n\nSUBCHAPTER I. REMARRIAGE"}
{"id": "Sec. 6.801", "title": "REMARRIAGE", "text": "(a)  Except as otherwise provided by this subchapter, neither party to a divorce may marry a third party before the 31st day after the date the divorce is decreed.\n\n(b)  The former spouses may marry each other at any time.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
{"id": "Sec. 6.802", "title": "WAIVER OF PROHIBITION AGAINST REMARRIAGE", "text": "For good cause shown the court may waive the prohibition against remarriage provided by this subchapter as to either or both spouses if a record of the proceedings is made and preserved or if findings of fact and conclusions of law are filed by the court.\n\n\nAdded by Acts 1997, 75th Leg., ch. 7, Sec. 1, eff. April 17, 1997."}
